Revit.Elements.Roof
MassLevelData

Revit.Elements.Roof.InternalRoof
An internal handle on the RoofBase

Revit.Elements.Roof.InternalElement
Reference to the Element

Revit.Elements.Roof.#ctor(Autodesk.Revit.DB.RoofBase)
Private constructor

Revit.Elements.Roof.#ctor(Autodesk.Revit.DB.CurveArray,Autodesk.Revit.DB.ReferencePlane,Autodesk.Revit.DB.Level,Autodesk.Revit.DB.RoofType,System.Double,System.Double)
Private constructor

Revit.Elements.Roof.InitRoof(Autodesk.Revit.DB.RoofBase)
Initialize a roof element

Revit.Elements.Roof.InitRoof(Autodesk.Revit.DB.CurveArray,Autodesk.Revit.DB.ReferencePlane,Autodesk.Revit.DB.Level,Autodesk.Revit.DB.RoofType,System.Double,System.Double)
Initialize a roof element

Revit.Elements.Roof.InitRoof(Autodesk.Revit.DB.CurveArray,Autodesk.Revit.DB.Level,Autodesk.Revit.DB.RoofType)
Initialize a roof element

Revit.Elements.Roof.InternalSetRoof(Autodesk.Revit.DB.RoofBase)
Set the InternalRoof property and the associated element id and unique id
Roof:

Revit.Elements.Roof.ByOutlineTypeAndLevel(Autodesk.DesignScript.Geometry.Curve[],Revit.Elements.RoofType,Revit.Elements.Level)
Create a Revit Roof given its curve outline and Level
outline:
RoofType:
level:
Returns: The Roof

Revit.Elements.Roof.ByOutlineExtrusionTypeAndLevel(Autodesk.DesignScript.Geometry.PolyCurve,Revit.Elements.RoofType,Revit.Elements.Level,Revit.Elements.ReferencePlane,System.Double,System.Double)
Extrude Roof by Outline, Referenceplane
outline:
roofType:
level:
plane:
extrusionStart:
extrusionEnd:
Returns:

Revit.Elements.Roof.Points
Get Slab Shape Points

Revit.Elements.Roof.AddPoint(Autodesk.DesignScript.Geometry.Point)
Add Point to Slab Shape

Revit.Elements.Roof.MovePoint(Autodesk.DesignScript.Geometry.Point,System.Double)
Move existing point by offset

Revit.Elements.Roof.FromExisting(Autodesk.Revit.DB.RoofBase,System.Boolean)
Create a Roof from a user selected Element.
roof:
isRevitOwned:
Returns: